/*-------------------------------------------------- 
練習一：小美買冰塊
小美他去超商買冰塊，
1.小美錢包有 200 元
2.他看到冰塊一包 25 元
3.他買了 7 包冰塊
4.請問他付費完，錢包還剩多少錢
-------------------------------------------------- */
let meiWallet = 200;
let icePrice = 25;

meiWallet = meiWallet - (icePrice * 7);

console.log(`小美錢包剩 ${meiWallet} 元`);

/*-------------------------------------------------- 
練習二：小華去速食店
1. 練習變數取名 (使用小駝峰)
2. 根據影片題目練習『賦予變數值』以及『計算出結果』
3. 提供 Chrome 執行結果的截圖

小華他去速食店吃中餐，他很擔心錢帶不夠，
他看了下菜單，漢堡一顆 50 元，可樂一瓶 30 元，
小華很口渴，所以他想要買一顆漢堡跟兩瓶可樂，
於是她看了口袋的錢，總共有 180 元，
請問小華如果買完的話，還剩多少錢？
-------------------------------------------------- */
let huaWallet = 180;
let hamburgerPrice = 50;
let cokePrice = 30;
let buyPrice = hamburgerPrice + cokePrice * 2;

huaWallet = huaWallet - buyPrice;

console.log(`小華還剩 ${huaWallet} 元`);